app/views/users/index.html.erb

        $scope.login = function() {
          $http({
            method: 'POST',
            url: '/users/login',
            params: {
              user: $scope.username,
              password: $scope.password
            }
          }).
            success(function(data, status, headers, config) {
              console.log(data);
              console.log("SUCCESS");
              if (data.errCode == SUCCESS) {
                $scope.name = $scope.username;
                $scope.loginCount = data.count;
                $scope.showMessage = true;
                $scope.showErrorMessage = false;
              }
              else {
                $scope.showMessage = false;
                $scope.showErrorMessage = true;
                $scope.errorMessage = "Cannot find user/password pair in database";
---
SELECT "users".* FROM "users"