app/controllers/users_controller.rb

  def add
    user = params[:user]
    password = params[:password]
    code = User.add(user, password)
    if code == 1
      countuser = User.find_by(user: user)
---
SELECT  "users".* FROM "users"  WHERE "users"."user" = 'test3' LIMIT 1

  def login
    user = params[:user]
    password = params[:password]
    login_user = User.find_by(user: user)
---
SELECT  "users".* FROM "users"  WHERE "users"."user" = 'test3' LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "password", "updated_at", "user", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-26 06:30:27.254245"], ["password", "awefawe"], ["updated_at", "2014-09-26 06:30:27.254245"], ["user", "awegaweg"], ["user_id", 20]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "id_num" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["id_num", nil], ["updated_at", "2014-09-26 06:32:24.043204"]]